---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.IGetLocalPathForOpenCallback
source: html/7fa4d5ef-2e0c-d7a0-6f81-9d9615fca996.htm
---
# IGetLocalPathForOpenCallback Members

Implement this method to specify the local path from where a copy of a Revit link external resource can be opened
 for modification without interfering with its use as a link in other open documents.